'number' + 3 + 3;
/*
result: number33
так як 'number' це рядок, js перетворює наступні цифри у рядки і з'єднує їх
*/

null + 3;
/*
result: 3
так як 'null' буде приведено до 0, а 0 + 3 = 3
*/

5 && "qwerty";
/*
result: "qwerty"
так як 5 це true повертається другий операнд
*/


+'40' + +'2' + "hillel";
/*
result: "42hillel"
унарний + перетворює рядки 40 і 2 на числа, після чого вони сумуються і виходить 42
потім відбувається додавання 42 + "hillel", якщо один з операндів є рядком, число 42 також конвертується у рядок, і відбувається додавання двох рядків
*/

'10' - 5 === 6;
/*
result: false
сперше буде виконано приведення рядка '10' до числа,
потім арифметичне віднімання 10 - 6, а потім строге порівняння 5 === 6
*/

true + false;
/*
result: 1
так як true = 1, а false = 0, арифметичне додавання 1 + 0 = 1
*/

'4px' - 3;
/*
result: NaN
js спробує конвертувати рядок '4px' на число, якщо спроба перетворення на число невдала, результат буде NaN
а будь-які операції з NaN повертають NaN
*/

'4' - 3;
/*
result: 1
js конвертує рядок '4' у число, і потім виконає арифметичне віднімання
*/

'6' + 3 ** 0;
/*
result: "61"
у оператора ** вищий пріоритет, тому спочатку 3 возведеться у степінь 0, що буде дорівнювати 1
так як наступний крок це додавання рядка і числа, 1 конвертується у рядок і буде конкатенація рядків '6' + '1'
*/

12 / '6';
/*
result: 2
js конвертує рядок '6' у число, і потім виконає ділення
*/

'10' + (5 === 6);
/*
result: "10false"
5 не дорівнює 6, тому результат буде false
js конвертує false у рядок, і потім виконає конкатенацію 2 рядків
*/

null == '';
/*
result: false
пустий рядок не дорівнює null
*/

3 ** (9 / 3);
/*
result: 27
спочатку виконується ділення, а потім 3 возводиться у степінь
*/

!!'false' == !!'true';
/*
result: true
будь-який непорожній рядок дорівнює true, тому true дорівнює true 
*/

0 || '0' && 1;
/*
result: 1
спочатку обчислюється '0' && 1, тому що у оператора && вищий пріоритет. Повертяється останній true операнд, тобто 1
Потім обчислюється 0 || 1, і повертається перший true операнд, тобто 1
*/

(+null == false) < 1;
/*
result: false
Спочатку null приводиться до числа 0, потім виконується 0 == false, false дорівнює 0 тому відповідь true
true дорівнює 1, тому 1 < 1 дорівнює false
*/

false && true || true;
/*
result: true
спочатку виконується false && true, і дорівнює першому хибному операнду, тобто false
потім віконується false || true, і дорівнює першому істинному операнду, тобто true
*/

false && (false || true);
/*
result: false
спочатку виконується (false || true) і дорівнює першому істинному варіанту операнду, тобто true
потім виконується false && true, і дорівнює першому хибному варіанту, тобто false
*/

(+null == false) < 1 ** 5;
/*
result: false
Спочатку виконується (+null == false), null конвертується у число, тобто 0. Потім порівнюється 0 == false(0), і дорівнює true
Потім виконується 1 ** 5, і дорівнює 1
Далі виконується true < 1, і так як true дорівнює 1, а 1 не менше 1, тому результат false 
*/